In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:
!conda install --y xlrd

Collecting package metadata (current_repodata.json): done
Solving environment: done


==> WARNING: A newer version of conda exists. <==
  current version: 4.12.0
  latest version: 23.1.0

Please update conda by running

    $ conda update -n base -c defaults conda



## Package Plan ##

  environment location: /Users/kwon-yong-geun/miniconda3/envs/ml

  added / updated specs:
    - xlrd


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    xlrd-2.0.1                 |     pyhd3eb1b0_0          90 KB
    ------------------------------------------------------------
                                           Total:          90 KB

The following NEW packages will be INSTALLED:

  xlrd               pkgs/main/noarch::xlrd-2.0.1-pyhd3eb1b0_0



Downloading and Extracting Packages
xlrd-2.0.1           | 90 KB     | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done

In [8]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

df = pd.read_excel("./data/excel-comp-data.xlsx")
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [9]:
df.head(2).T

                                      0                  1
account                          211829             320563
name         Kerluke, Koepp and Hilpert     Walter-Trantow
street               34456 Sean Highway  1311 Alvis Tunnel
city                         New Jaycob      Port Khadijah
state                             Texas      NorthCarolina
postal-code                       28752              38365
Jan                               10000              95000
Feb                               62000              45000
Mar                               35000              35000

In [12]:
# 그냥 넣어주면 시리즈 형태로 뽑힘
df["account"]

0    211829
1    320563
2    648336
3    109996
4    121213
Name: account, dtype: int64

In [13]:
# list 꼴로 넣어주면 DataFrame으로 뽑힘
df[["account"]]

   account
0   211829
1   320563
2   648336
3   109996
4   121213

In [15]:
# 인덱스 3개 뽑기
df[:3]

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000

In [17]:
# Series 데이터에 접근한 뒤에, 3개 뽑기
df["account"][:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [21]:
account_series = df["account"]
account_series[:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [30]:
# 0번째, 첫번째, 세번째 데이터 뽑기
account_series[[0, 1, 3]]

0    211829
1    320563
3    109996
Name: account, dtype: int64

In [31]:
# Selection - account_series 가 250000보다 작은 값만 뽑음
account_series[account_series < 250000]

0    211829
3    109996
4    121213
Name: account, dtype: int64

In [36]:
list(range(0, 5, 2))

[0, 2, 4]

In [38]:
# 인덱스 번호로 뽑아오기
account_series[list(range(0, 5, 2))]

0    211829
2    648336
4    121213
Name: account, dtype: int64

In [41]:
# 인덱스 변경 가능
df.index = df["account"]
del df["account"]
df.head()

KeyError: 'account'

In [42]:
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [44]:
# 해당 column 에서 2개 뽑기
df[["name", "street"]][:2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [46]:
# 각각 index 와 column의 이름을 적어줌
df.loc[[211829, 320563], ["name", "street"]]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [48]:
# column number와 index number
df.iloc[:2, :2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [49]:
df.iloc[:5, :3]

,name,street,city
account,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester

In [54]:
# df가 변한 것은 아니고, 새로 생성된 index를 보여줌
df.reset_index()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [55]:
# df가 변한 것은 아니고, 새로 생성된 index를 보여줌
df

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [56]:
# 기존의 인덱스 없애기
df.reset_index(drop = True)

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [58]:
# df가 변한 것은 아님
df

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [65]:
# inplace = True 를 하게 되면 변경된 값이 들어가게 됨
df.reset_index(inplace = True, drop = True)

In [67]:
# inplace = True 를 해서 변경된 값이 들어갔음
df

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [69]:
df

,index,name,street,city,state,postal-code,Jan,Feb,Mar
0,0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [71]:
df.reset_index(inplace = True)
df

,level_0,index,name,street,city,state,postal-code,Jan,Feb,Mar
0,0,0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,1,1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,2,2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,3,3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,4,4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

- inplace = True를 하게 되면 자기 자신이 변화가 일어난다

In [76]:
# drop을 하게 되도 df 자체를 변화시키지는 않음
df.drop(1)

,level_0,index,name,street,city,state,postal-code,Jan,Feb,Mar
0,0,0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,2,2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,3,3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,4,4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [77]:
df

,level_0,index,name,street,city,state,postal-code,Jan,Feb,Mar
0,0,0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,1,1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,2,2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,3,3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,4,4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [80]:
# 한번에 여러개 삭제 가능
df.drop([1, 2, 3])

,level_0,index,name,street,city,state,postal-code,Jan,Feb,Mar
0,0,0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
4,4,4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [82]:
# axis 지정으로 축을 기준으로 drop
df.drop("city", axis = 1)

,level_0,index,name,street,state,postal-code,Jan,Feb,Mar
0,0,0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,1,1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,2,2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,lowa,76517,91000,120000,35000
3,3,3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,4,4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000

In [85]:
# index 라는 column을 아예 삭제해버림
df.drop("index", axis = 1, inplace = True)

KeyError: "['index'] not found in axis"

In [86]:
df

,level_0,name,street,city,state,postal-code,Jan,Feb,Mar
0,0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [87]:
# level_0 라는 column을 아예 삭제해버림
df.drop("level_0", axis = 1, inplace = True)

In [88]:
df

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [92]:
df.reset_index(inplace = True)

In [93]:
df

,index,name,street,city,state,postal-code,Jan,Feb,Mar
0,0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [94]:
df.drop("index", axis = 1, inplace = True)

In [95]:
df

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [97]:
df.values

array([['Kerluke, Koepp and Hilpert', '34456 Sean Highway', 'New Jaycob',
        'Texas', 28752, 10000, 62000, 35000],
       ['Walter-Trantow', '1311 Alvis Tunnel', 'Port Khadijah',
        'NorthCarolina', 38365, 95000, 45000, 35000],
       ['Bashirian, Kunde and Price',
        '62184 Schamberger Underpass Apt. 231', 'New Lilianland', 'lowa',
        76517, 91000, 120000, 35000],
       ["D'Amore, Gleichner and Bode", '155 Fadel Crescent Apt. 144',
        'Hyattburgh', 'Maine', 46021, 45000, 120000, 10000],
       ['Bauch-Goldner', '7274 Marissa Common', 'Shanahanchester',
        'California', 49681, 162000, 120000, 35000]], dtype=object)

### DataFrame Operation

In [98]:
s1 = Series(range(1, 6), index = list("abcde"))
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [99]:
s2 = Series(range(5, 11), index = list("bcedef"))

In [100]:
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [113]:
# 비는 값이 생기게 된다 (겹치는 Index가 없는 경우 NAN으로 반환), e는 두 개가 있으므로 연산도 두번 일어남
# Series에서는 index가 중복을 허용함
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [107]:
df1 = DataFrame(np.arange(9).reshape(3,3),columns = list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [108]:
df2 = DataFrame(np.arange(16).reshape(4,4),columns = list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [109]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [111]:
# 비어 있는 값이 없도록 출력. Add operation을 쓰면 NAN값을 0으로 변환
df1.add(df2, fill_value = 0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

### Series addition operation

In [112]:
s1 = Series(range(1, 6), index = list("abced"))
s1

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [114]:
df2 = DataFrame(np.arange(16).reshape(4,4),columns = list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [115]:
s2 = Series(np.arange(10, 14))
s2

0    10
1    11
2    12
3    13
dtype: int64

In [117]:
# 그냥 더해주면 연산이 일어나지 않음
df2 + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [120]:
# axis를 기준으로 row broadcasting을 실행
df2.add(s2, axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

### lambda, map, apply

- pandas의 series type의 데이터에도 map 함수 사용가능
- function 대신 dict, sequence형 자료등으로 대체 가능

In [121]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [124]:
# 긱각에 제곱값을 반환
s1.map(lambda x: x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [131]:
z = {1: 'A', 2: 'B', 3: 'C'}
z

{1: 'A', 2: 'B', 3: 'C'}

In [135]:
#dict type 데이터 교체, 없는 값은 NaN
s1.map(z).head(5)

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [127]:
s2 = Series(np.arange(10, 20))
s2

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

In [136]:
# 같은 위치의 데이터를 s2로 전환함 (index를 기준으로 mapping)
s1.map(s2).head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [139]:
df

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [141]:
# mapping example
df["march_score"] = df.Mar.map({35000:0, 10000:1})
df

,name,street,city,state,postal-code,Jan,Feb,Mar,march_score
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000,0
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000,0
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000,0
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000,1
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000,0

In [148]:
# replace (dict type으로)
df.march_score.replace({
    0:"good", 1:"bad"
})

0    good
1    good
2    good
3     bad
4    good
Name: march_score, dtype: object

In [153]:
# replace (list indexing)
df.march_score.replace(
    [0, 1],
    ["good", "bad"], inplace = True
)
df

,name,street,city,state,postal-code,Jan,Feb,Mar,march_score
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000,good
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000,good
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,lowa,76517,91000,120000,35000,good
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000,bad
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000,good

### lambda function examples

In [154]:
f = lambda x, y: x + y
f(1, 4)

5

In [155]:
def f(x, y):
    return x + y

In [156]:
f = lambda x : x**2
f(3)

9

In [157]:
f = lambda x: x + 5
f(3)

8

In [158]:
(lambda x: x + 1)(5)

6

### map & replace examples

In [159]:
ex = [1, 2, 3, 4, 5]
f = lambda x : x**2
list(map(f, ex))

[1, 4, 9, 16, 25]

In [162]:
f = lambda x, y: x + y
list(map(f, ex, ex))

[2, 4, 6, 8, 10]

In [164]:
# python3 에는 list를 꼭 붙여줘야 함
list(map(lambda x : x + 5, ex))

[6, 7, 8, 9, 10]

In [165]:
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [166]:
def f(x):
    return x + 5

s1.map(f)

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

In [167]:
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [168]:
z = {1: 'A', 2: 'B', 3: 'C'}
s1.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [169]:
s2 = Series(np.arange(10, 30))
s2

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
11    21
12    22
13    23
14    24
15    25
16    26
17    27
18    28
19    29
dtype: int64

In [170]:
s1.map(s2)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

In [2]:
import pandas as pd
df = pd.read_csv("./data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [6]:
# unique를 사용하면 각 column에 존재하는 값들을 하나씩만 배열에 담아준다
df.sex.unique()

array(['male', 'female'], dtype=object)

In [7]:
# unique를 사용하면 각 column에 존재하는 값들을 하나씩만 배열에 담아준다
df.head().age.unique()

array([49, 62, 33, 95, 43])

In [8]:
def change_sex(x):
    return 0 if x == "male" else 1

df.sex.map(change_sex)

0       0
1       1
2       1
3       1
4       1
       ..
1374    0
1375    1
1376    1
1377    0
1378    0
Name: sex, Length: 1379, dtype: int64

In [10]:
# 기존의 값에는 변화가 없음
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [13]:
# 할당 시켜주기 (1)
df["sex_code"] = df.sex.map(change_sex)
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [14]:
# 할당 시켜주기 (2)
df["sex_code2"] = df.sex.map({"male": 0, "female": 1})
df.head()

           earn  height     sex   race  ed  age  sex_code  sex_code2
0  79571.299011   73.89    male  white  16   49         0          0
1  96396.988643   66.23  female  white  16   62         1          1
2  48710.666947   63.77  female  white  16   33         1          1
3  80478.096153   63.22  female  other  16   95         1          1
4  82089.345498   63.08  female  white  17   43         1          1

In [19]:
df.drop(labels = "sex_code2", axis = 1, inplace = True)
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [28]:
df.sex_code.replace({0: 1, 1: 0})

0       1
1       0
2       0
3       0
4       0
       ..
1374    1
1375    0
1376    0
1377    1
1378    1
Name: sex_code, Length: 1379, dtype: int64

In [30]:
df.drop("sex_code", axis = 1, inplace = True)

In [31]:
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

### Apply for dataframe

- map과 달리, series 전체(column)에 해당 함수를 적용
- 입력 값이 series 데이터로 입력 받아 handling 가능
- 통계치를 나타낼때 많이 사용함

In [32]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [34]:
# 각 column 별로 결과값 반환
f = lambda x : x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [35]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [37]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [39]:
# scalar 값 이외에 series값의 반환도 가능함
from pandas import Series, DataFrame
def f(x):
    return Series([x.min(), x.max()], index = ["min", "max"])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

### applymap for dataframe

- Series 단위가 아닌 element 단위로 함수를 적용함
- Series 단위에 apply를 적용시킬 때와 같은 효과

In [41]:
# 모든 data에 - 붙히기
f = lambda x : -x
df_info.applymap(f).head()

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [42]:
# apply 함수를 series 단위로 적용시키면, map과 같은 효과가 나타남
f = lambda x : -x
df_info["earn"].apply(f).head()

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

In [43]:
f = lambda x : -x
df_info.earn.map(f).head()

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

In [46]:
# apply는 아래와 같이 주로 column 단위로 적용시킴.
import numpy as np
f = lambda x : np.mean(x)
df_info.apply(f)

earn      32446.292622
height       66.592640
age          45.328499
dtype: float64

In [49]:
def f(x):
    return Series(
        [x.min(), x.max(), x.mean(), sum(x.isnull())],
        index = ["min", "max", "mean", 'null']
    )

df_info.apply(f)

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.127955  77.21000  95.000000
mean   32446.292622  66.59264  45.328499
null       0.000000   0.00000   0.000000

In [51]:
# applymap은 모든 값에 다 적용된다
f = lambda x: x // 2 
df_info.applymap(f).head()

      earn  height  age
0  39785.0    36.0   24
1  48198.0    33.0   31
2  24355.0    31.0   16
3  40239.0    31.0   47
4  41044.0    31.0   21

In [53]:
f = lambda x: x**2
df_info["earn"].apply(f)

0       6.331592e+09
1       9.292379e+09
2       2.372729e+09
3       6.476724e+09
4       6.738661e+09
            ...
1374    9.104329e+08
1375    6.176974e+08
1376    1.879825e+08
1377    9.106124e+09
1378    9.168947e+07
Name: earn, Length: 1379, dtype: float64

### pandas built-in functions

### describe

- 가지고 있는 값들에 대해서 설명해줌
- Numeric type 데이터의 요약 정보를 보여줌
- 외우는 것보다는 필요할 때마다 찾아보기

In [55]:
df = pd.read_csv("./data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [56]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

### unique
- series data의 유일한 값을 list로 반환함

In [72]:
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [74]:
# labeling 값으로 변경
key = df.race.unique()
value = range(len(df.race.unique()))
df["race"].replace(to_replace = key, value = value)

0       0
1       0
2       0
3       1
4       0
       ..
1374    0
1375    0
1376    0
1377    0
1378    0
Name: race, Length: 1379, dtype: int64

In [77]:
dict(enumerate(sorted(df["race"].unique())))

{0: 'black', 1: 'hispanic', 2: 'other', 3: 'white'}

### sum 
- 기본적인 column 또는 row 값의 연산을 지원
- sub, mean, min, max, count, median, mad, var 등

In [58]:
# column 별
df.sum(axis=0)

earn                                          44743437.5254
height                                             91831.25
sex       malefemalefemalefemalefemalefemalefemalemalema...
race      whitewhitewhiteotherwhitewhitewhitewhitehispan...
ed                                                    18416
age                                                   62508
dtype: object

In [60]:
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [61]:
# row 별
df.sum(axis = 1)

/var/folders/w3/8l1p0j1d51s69f3vlw1939ym0000gn/T/ipykernel_43485/1812523176.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis = 1)

0       79710.189011
1       96541.218643
2       48823.436947
3       80652.316153
4       82212.425498
            ...
1374    30290.060363
1375    25018.829514
1376    13823.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

### isnull
- column 또는 row 값의 NaN (null) 값의 index를 반환함

In [62]:
df.isnull()

       earn  height    sex   race     ed    age
0     False   False  False  False  False  False
1     False   False  False  False  False  False
2     False   False  False  False  False  False
3     False   False  False  False  False  False
4     False   False  False  False  False  False
...     ...     ...    ...    ...    ...    ...
1374  False   False  False  False  False  False
1375  False   False  False  False  False  False
1376  False   False  False  False  False  False
1377  False   False  False  False  False  False
1378  False   False  False  False  False  False

[1379 rows x 6 columns]

In [63]:
# sum 함수를 같이 사용해서 얼마나 비어있는지를 알 수 있음
df.isnull().sum()

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

### sort_values

- column 값을 기준으로 데이터를 sorting 해줌

In [64]:
df.sort_values(["age", "earn"], ascending=True).head(10)

             earn  height     sex      race  ed  age
1038   -56.321979   67.81    male  hispanic  10   22
800    -27.876819   72.29    male     white  12   22
963    -25.655260   68.90    male     white  12   22
1105   988.565070   64.71  female     white  12   22
801   1000.221504   64.09  female     white  12   22
862   1002.023843   66.59  female     white  12   22
933   1007.994941   68.26  female     white  12   22
988   1578.542814   64.53    male     white  12   22
522   1955.168187   69.87  female     black  12   22
765   2581.870402   64.79  female     white  12   22

### Correlation & Covariance
- 상관계수와 공분산을 구하는 함수
- corr, cov, corrwith

In [66]:
# 상관계수  df.column_1.corr(column_2)
df.age.corr(df.earn)

0.07400349177836056

In [67]:
# 공분산
df.age.cov(df.earn)

36523.69921040891

In [68]:
# corrwith - 나머지 값들과의 모든 상관계수를 볼 수 있음
df.corrwith(df.earn)

/var/folders/w3/8l1p0j1d51s69f3vlw1939ym0000gn/T/ipykernel_43485/1782325299.py:2: FutureWarning: The default value of numeric_only in DataFrame.corrwith is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corrwith(df.earn)

earn      1.000000
height    0.291600
ed        0.350374
age       0.074003
dtype: float64

In [69]:
# 모든 값들 사이의 상관관계
df.corr()

/var/folders/w3/8l1p0j1d51s69f3vlw1939ym0000gn/T/ipykernel_43485/960276301.py:2: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

            earn    height        ed       age
earn    1.000000  0.291600  0.350374  0.074003
height  0.291600  1.000000  0.114047 -0.133727
ed      0.350374  0.114047  1.000000 -0.129802
age     0.074003 -0.133727 -0.129802  1.000000

In [79]:
# 많이 다루게 되는 column들은 따로 지정해놓고 쓰는 것이 유용하다
numeric_cols = ["earn", "height", "ed", "age"]
df[numeric_cols]

              earn  height  ed  age
0     79571.299011   73.89  16   49
1     96396.988643   66.23  16   62
2     48710.666947   63.77  16   33
3     80478.096153   63.22  16   95
4     82089.345498   63.08  17   43
...            ...     ...  ..  ...
1374  30173.380363   71.68  12   33
1375  24853.519514   61.31  18   86
1376  13710.671312   63.64  12   37
1377  95426.014410   71.65  12   54
1378   9575.461857   68.22  12   31

[1379 rows x 4 columns]

In [80]:
numeric_cols = ["earn", "height", "ed", "age"]
df[numeric_cols].sum(axis = 0)

earn      4.474344e+07
height    9.183125e+04
ed        1.841600e+04
age       6.250800e+04
dtype: float64

In [81]:
# 볼 수 있는 row 개수 조정 가능
pd.options.display.max_rows = 100

In [84]:
# 오름차순 정렬 (index 값이 섞여서 나옴)
df.sort_values(["age", "earn"], ascending=True)

              earn  height     sex      race  ed  age
1038    -56.321979   67.81    male  hispanic  10   22
800     -27.876819   72.29    male     white  12   22
963     -25.655260   68.90    male     white  12   22
1105    988.565070   64.71  female     white  12   22
801    1000.221504   64.09  female     white  12   22
...            ...     ...     ...       ...  ..  ...
993   32809.632677   59.61  female     other  16   92
102   39751.194030   67.14    male     white  12   93
331   39169.750135   64.79  female     white  12   95
809   42963.362005   72.94    male     white  12   95
3     80478.096153   63.22  female     other  16   95

[1379 rows x 6 columns]

In [85]:
# 나이가 15세와 45세 사이인 사람만 뽑기
df.age[(df.age < 45) & (df.age > 15)]

2       33
4       43
5       30
8       25
9       30
        ..
1369    24
1373    40
1374    33
1376    37
1378    31
Name: age, Length: 772, dtype: int64

In [87]:
# 나이가 15세와 45세 사이인 사람과 소득의 상관관계
df.age[(df.age < 45) & (df.age > 15)].corr(df.earn)

0.31411788725189044

In [89]:
# 그냥 나이와 소득의 상관관계보다 15세와 45세 사이인 사람과 소득의 상관관계가 더 높다
# 일하는 연령이 소득이 더 많을 것이다 = 참
df.age.corr(df.earn)

0.07400349177836056

In [90]:
# male, female 등은 상관관계를 보기 힘들기 때문에 labeling 해서 상관관계를 볼 수 있다.
df["sex_code"] = df["sex"].replace({"male":1, "female": 0})

In [91]:
df.corr()

/var/folders/w3/8l1p0j1d51s69f3vlw1939ym0000gn/T/ipykernel_43485/1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

              earn    height        ed       age  sex_code
earn      1.000000  0.291600  0.350374  0.074003  0.337328
height    0.291600  1.000000  0.114047 -0.133727  0.703672
ed        0.350374  0.114047  1.000000 -0.129802  0.061747
age       0.074003 -0.133727 -0.129802  1.000000 -0.070036
sex_code  0.337328  0.703672  0.061747 -0.070036  1.000000

In [92]:
df.corrwith(df.earn)

/var/folders/w3/8l1p0j1d51s69f3vlw1939ym0000gn/T/ipykernel_43485/928202080.py:1: FutureWarning: The default value of numeric_only in DataFrame.corrwith is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corrwith(df.earn)

earn        1.000000
height      0.291600
ed          0.350374
age         0.074003
sex_code    0.337328
dtype: float64

In [93]:
df

              earn  height     sex   race  ed  age  sex_code
0     79571.299011   73.89    male  white  16   49         1
1     96396.988643   66.23  female  white  16   62         0
2     48710.666947   63.77  female  white  16   33         0
3     80478.096153   63.22  female  other  16   95         0
4     82089.345498   63.08  female  white  17   43         0
...            ...     ...     ...    ...  ..  ...       ...
1374  30173.380363   71.68    male  white  12   33         1
1375  24853.519514   61.31  female  white  18   86         0
1376  13710.671312   63.64  female  white  12   37         0
1377  95426.014410   71.65    male  white  12   54         1
1378   9575.461857   68.22    male  white  12   31         1

[1379 rows x 7 columns]

In [94]:
# 개수가 몇 개인지
df.sex.value_counts(sort = True)

female    859
male      520
Name: sex, dtype: int64

In [95]:
# 개수가 몇 개인지 비율로 나타내기
df.sex.value_counts(sort = True) / len(df)

female    0.622915
male      0.377085
Name: sex, dtype: float64